alexlinde/claudius/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash - 16 MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - 8 MB Octal
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Place malloc in SPIRAM when possible
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# LVGL (configured via Kconfig, LV_CONF_SKIP=y is the default)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_LOG=n

# Compiler optimisation
CONFIG_COMPILER_OPTIMIZATION_PERF=y
